Dlubal.TimberPro.DesignCombinationType
Type of design combination.

Dlubal.TimberPro.DesignCombinationType.UnknownDesignCombination
Unknown

Dlubal.TimberPro.DesignCombinationType.DesignCombinationCharacteristicWithoutCreep
Characteristic combination (without creep component)

Dlubal.TimberPro.DesignCombinationType.DesignCombinationCharacteristicWithCreep
Characteristic combination (with creep component)

Dlubal.TimberPro.DesignCombinationType.DesignCombinationRare
Rare combination

Dlubal.TimberPro.DesignCombinationType.DesignCombinationFrequent
Quasi-permanent combination (with creep component)

Dlubal.TimberPro.DesignCombinationType.DesignCombinationCharacteristicQuasiPermanent
Characteristic / quasi-permanent combination

Dlubal.TimberPro.DesignCombinationType.DesignCombinationQuasiPermanentWithPrecamber
Quasi-permanent combination with precamber

Dlubal.TimberPro.DesignCombinationType.DesignCombinationQuasiPermanentWithoutPrecamber
Quasi-permanent combination without precamber

Dlubal.TimberPro.DesignCombinationType.DesignCombinationVibrationDesign
Vibration design